import re

date_formate_re=re.compile(r'(\d\d).(\d\d).(\d\d\d\d)|((০|১|২|৩|৪|৫|৬|৭|৮|৯)(০|১|২|৩|৪|৫|৬|৭|৮|৯)).((০|১)(০|১|২|৩|৪|৫|৬|৭|৮|৯)).((০|১|২|৩|৪|৫|৬|৭|৮|৯)(০|১|২|৩|৪|৫|৬|৭|৮|৯)(০|১|২|৩|৪|৫|৬|৭|৮|৯)(০|১|২|৩|৪|৫|৬|৭|৮|৯))')
division_re=re.compile(r'বিভাগ\s*:|বিভাগ:')
point_re=re.compile(r'(\d\d).\s|((০|১|২|৩|৪|৫|৬|৭|৮|৯)(০|১|২|৩|৪|৫|৬|৭|৮|৯)).\s')
cost_value_re=re.compile(r'\d+.\d+|(০|১|২|৩|৪|৫|৬|৭|৮|৯)+.(০|১|২|৩|৪|৫|৬|৭|৮|৯)+')
estimated_cost_re=re.compile(r'প্রকল্পটির\s*প্রাক্কলিত\s*ব্যয়|প্রাক্কলিত\s*ব্যয়|প্রকল্পটির প্রাক্কলিত ব্যয়|প্রাক্কলিত\s*ব্যয়')
total_re=re.compile(r'মোট')
total_suplimentary_re=re.compile(r'হয়েছে|ব্যয়')
and_re=re.compile(r'এবং|\(|তন্মধ্যে')
project_date_re=re.compile(r'বাস্তবায়নকাল|বাস্তবায়নকাল')
from_re=re.compile(r'হতে|থেকে')
year_re=re.compile(r'\d\d\d\d|(০|১|২|৩|৪|৫|৬|৭|৮|৯)(০|১|২|৩|৪|৫|৬|৭|৮|৯)(০|১|২|৩|৪|৫|৬|৭|৮|৯)(০|১|২|৩|৪|৫|৬|৭|৮|৯)')

activity_re=re.compile(r'প্রকল্পটির\s*প্রধান\s*কার্যক্রমসমূহ|কার্যক্রমসমূহ')